app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT "books".* FROM "books" WHERE (LOWER(bookname) LIKE '%r%' OR LOWER(bookdescription) LIKE '%r%' OR LOWER(author) LIKE '%r%' OR LOWER(vendorname) LIKE '%r%' OR LOWER(vendormail) LIKE '%r%' OR LOWER(status) LIKE '%r%' OR LOWER(vendorname) LIKE '%r%' OR LOWER(vendormail) LIKE '%r%' OR LOWER(position) LIKE '%r%' )

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("bookname", "bookdescription", "vendorname", "vendormail", "userid", "created_at", "updated_at", "status", "position") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "userid" = ?, "updated_at" = ?, "author" = ? WHERE "books"."id" = ?  [["userid", "2"], ["updated_at", "2021-10-27 10:58:06.634578"], ["author", "anabelle,joswin"], ["id", 2]]