app/controllers/requests_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "requests" ("request", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["request", "Request"], ["book_id", 2], ["user_id", 1], ["created_at", "2021-10-31 18:24:02.255236"], ["updated_at", "2021-10-31 18:24:02.255236"]]
---
  def create
    @book = Book.find(params[:book_id])
    @request = @book.requests.new(request_params)

    respond_to do |format|
      if @request.save